app/views/users/show.html.erb

          <ul class="nav nav-pills">
            <% @user.carts.each do |cart| %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?

                            <% if @user.id == current_user.id %>
                              <% cart.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?

                            <% else %>
                              <% cart.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?