app/views/follows/index.html.erb

SELECT "users".* FROM "users"
---

            <%= select_tag("following_id", options_from_collection_for_select(User.all, :id, :email,4), :class => "form-control") %>

SELECT "follows".* FROM "follows" WHERE "follows"."following_id" = ?  [["following_id", 2]]
---
                <div class="col-md-4 col-md-offset-1">
                  <a href="/users/<%= @users.find(follow.following_id).id %>" class="btn btn-link btn-block"><%= @users.find(follow.following_id).email %></a>