app/views/follows/new.html.erb

        <!-- Still hoping to turn this into an autocomplete search-->
        <%= select_tag("following_id", options_from_collection_for_select(User.all, :id, :email), :class => "form-control") %>
---
SELECT "users".* FROM "users"