app/controllers/carts_controller.rb

  def create
    @cart = Cart.new

    @cart.user_id = params[:user_id]
    @cart.cart_name = params[:cart_name]

    save_status = @cart.save
---
INSERT INTO "carts" ("user_id", "cart_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["cart_name", "Lindsay"], ["created_at", "2017-10-24 05:28:23.673370"], ["updated_at", "2017-10-24 05:28:23.673370"]]