app/controllers/follows_controller.rb

  def index
    @follows = current_user.follows
    @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 0

  def show
    @follow = Follow.find(params[:id])
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @follow = Follow.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @follow = Follow.new

    @follow.follower_id = params[:follower_id]
    @follow.following_id = params[:following_id]

    save_status = @follow.save
---
INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["following_id", 0], ["created_at", "2017-10-25 22:28:43.986316"], ["updated_at", "2017-10-25 22:28:43.986316"]]

  def destroy
    @follow = Follow.find(params[:id])

    @follow.destroy
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]