app/controllers/follows_controller.rb

  def index
    @follows = Follow.all
---
SELECT "follows".* FROM "follows"