app/controllers/items_controller.rb

INSERT INTO "items" ("quantity_wanted", "description", "item_name", "item_url", "quantity_received", "cart_id", "image_url", "vendor_id", "gotit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    @item.image_url = #temporarily 'price' #coming soon" #blank for now #params[:image_url]
    @item.cart_id = params[:cart_id]

    save_status = @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1
UPDATE "items" SET "gotit" = ?, "updated_at" = ? WHERE "items"."id" = ?
---
  def update
    @item = Item.find(params[:id])

    @item.item_name = params[:item_name]
    @item.description = params[:description]
    @item.quantity_wanted = params[:quantity_wanted]
    @item.quantity_received = params[:quantity_received]
    @item.item_url = params[:item_url]
    @item.vendor_id = params[:vendor_id]
    @item.image_url = params[:image_url]
    @item.cart_id = params[:cart_id]

    save_status = @item.save